snlkuharlocal/src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АвансовыйОтчет</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредОстаток</name>
    <comment>Сумма остатка (перерасхода) предыдущего аванса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОстатка</name>
    <comment>1-остаток, 2-перерасход</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриложеноДок</name>
    <comment>Приложено сколько документов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаЛистах</name>
    <comment>Количество листов приложенных документов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАванса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомуЗаЧто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоОтчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>Получено</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/АвансовыйОтчет/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();
		Движения.Затраты.Записать();
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли;
	ВалютаУпр			=ПараметрыСеанса.ВалютаУпр_2009;	
	ВалютаРасчетов		=ПолучитьВалютуРасчетов(Договор);
	
	Ошибки="";
	
	КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,	Дата);
	КурсВалютыДокумента	=ПолучитьКурсВалюты_ПоРусски(Валюта,	Дата);
	
	СуммаУпр			=глПересчет(СуммаДокумента,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);
	КурсоваяРазница		=0;
	
	Для Каждого СтрокаТЧ Из Затраты Цикл
		СуммаДок 					= СтрокаТЧ.Сумма;
		
		Если СуммаДок=0 Тогда Продолжить КонецЕсли; 
		
		Движение 					= Движения.Затраты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= СтрокаТЧ.Подразделение;
		Движение.СтатьяЗатрат		= СтрокаТЧ.СтатьяЗатрат;			
		Движение.СубЗатрата			= СтрокаТЧ.СубЗатрата;
				
		Движение.СуммаУпр			= глПересчет(СуммаДок,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);
		
		Движение.Проект				= СтрокаТЧ.Проект;
		Движение.ПериодРасходов		= ?(ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов),НачалоМесяца(СтрокаТЧ.ПериодРасходов),НачалоМесяца(Дата));
		
		Движение.Контрагент			= Сотрудник;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= СуммаДок;
		Движение.ВалютаДокумента	= Валюта;
		//крохин начало
		Движение.Комментарий        = СтрокаТЧ.Комментарий;
		Движение.КапитальныеЗатраты = СтрокаТЧ.КапитальныеЗатраты;
		//крохин конец
		
		Движение.ДатаЗаписи			= ТекущаяДата();
	КонецЦикла;
	
	
	Движение 					= Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
	
	Движение.Период				= Дата;
	Движение.Контрагент			= Сотрудник;
	Движение.Договор 			= Договор;			
	
	Движение.СуммаВал			= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаРасчетов,Дата);
	Движение.СуммаУпр			= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,КурсУпр);
	
	Движение.СуммаДокумента		= СуммаДокумента;
	Движение.ВалютаДокумента	= Валюта;	
	//Движение.СтатьяДДС			= СтатьяДДС;			
	
	Если ДокОснование<>Неопределено И ЕстьРеквизитДокумента("КодОперации",ДокОснование.Метаданные()) Тогда
		Движение.КодОперации=ДокОснование.КодОперации;			
	КонецЕсли;		
	
	КурсоваяРазница=СуммаУпр-Движение.СуммаУпр;
	Если КурсоваяРазница<>0 Тогда
		Движение 					= Движения.Затраты.Добавить();
		
		Движение.ВидДвижения		= ?(КурсоваяРазница>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= Подразделение;
		Движение.СтатьяЗатрат		= Справочники.СтатьиЗатрат.КурсовыеРазницы;			
		
		Движение.СуммаУпр			= Модуль(КурсоваяРазница);			
		
		Движение.Контрагент			= Сотрудник;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= 0;
		Движение.ВалютаДокумента	= Валюта;	
		//крохин начало
		Движение.Комментарий        = "Курсовая разница";
		//крохин конец

		
		Движение.ДатаЗаписи			= ТекущаяДата();					
	КонецЕсли;	
	
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//крохин начало
	//АВО никуда не грузятся, документ только для офиса
	НужноВыгружать = Ложь;
	//крохин конец
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЕстьИзменения Тогда
		СуммаДокумента=Затраты.Итог("Сумма");		
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор   		= Неопределено;
	Курс			= 0;	
	Дата			= Неопределено;	
	
	Затраты.Очистить();
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
